html/lc-2952-minimum-number-of-coins-to-be-added.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LC 2952. 需要添加的硬币的最小数量</title>
<meta name="author" content="dirtysalt" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">LC 2952. 需要添加的硬币的最小数量</h1>
<p>
<a href="https://leetcode.cn/problems/minimum-number-of-coins-to-be-added/description/">https://leetcode.cn/problems/minimum-number-of-coins-to-be-added/description/</a>
</p>

<p>
<a href="https://leetcode.cn/problems/minimum-number-of-coins-to-be-added/solutions/2551707/yong-gui-na-fa-si-kao-pythonjavacgo-by-e-8etj/">题解</a> 写的非常好，就是使用归纳法:
</p>
<ul class="org-ul">
<li>假设我们已经收集了 `[1, s)` ，然后遇到下一个元素是X</li>
<li>如果 `x &gt; s` 的话，那么从 `[s, x)` 中间就会出现空档, 没有办法覆盖到。我们需要先收集 `s`</li>
<li>如果 `x &lt;= s` 的话，那么没有问题，我们覆盖的范围就到了 `[1, s + x)`.</li>
</ul>

<div class="org-src-container">
<pre class="src src-Python">class Solution:
    def minimumAddedCoins(self, coins: List[int], target: int) -&gt; int:
        coins.sort()
        ans, s, i = 0, 1, 0
        while s &lt;= target:
            if i &lt; len(coins) and coins[i] &lt;= s:
                s += coins[i]
                i += 1
            else:
                s += s
                ans += 1
        return ans
</pre>
</div>
</div>
</body>
</html>
